[
  {
    "asin": "B01M16WBW1",
    "rank": 1,
    "title": "Queen Size 4 Piece Sheet Set - Comfy Breathable & Cooling Bed Sheets Set - Hotel Luxury Bedding for Women, Men, Kids & Teens - Deep Pockets, Easy Secure Fit, Soft and Wrinkle Free - Oeko-Tex - White",
    "price": "$24.99",
    "list_price": "$41.99",
    "discount": "40%",
    "rating": "4.4 out of 5 stars",
    "reviews_count": "406,573 ratings",
    "is_prime": true,
    "best_sellers_rank": "1 in Home & Kitchen ",
    "bullet_points": [
      "4 PIECE BED SHEET SET: 2 pillow cases and a flat sheet and fitted sheet. Flat Sheet (102”x 90”) Fitted Sheet (80”x 60”) 2 Pillow Cases (20” x 30”).",
      "DEEP POCKETS/ EASY FIT: They fit mattresses up to around 16 inches deep. If your mattress is smaller than 16 inches it will fit just fine. A lot of mattresses are pretty big these days and we feel this is a good universal size that fits most mattresses.",
      "FEEL THE DIFFERENCE: If you're looking for very soft sheets you have found them! They're breathable, cool and super silky soft. The comfort of these sheets will have you coming back! They're softer than Egyptian cotton and organic cotton sheets! Best for any room in your house - bedroom, guest room, kids room, RV, vacation home. Great sheet and pillowcase sets for kids, teens, men and women.",
      "HIGHEST QUALITY BRUSHED MICROFIBER: A lighter difference. A softer, finer touch. These are made of the highest quality double brushed microfiber yarns. The virtually weightless wonder of CGK Unlimited sheets will have you coming back for more. Linger in your dreams.",
      "GREAT SHEETS FOR THE PRICE! These are some of the softest and most affordable sheets you’ll find. Great bang for your buck as far as comfort and softness and unlike many other very expensive sheets & materials, these CGK Bed Sheets will give you comfort and softness at a reasonable price."
    ],
    "main_image_url": "https://m.media-amazon.com/images/I/71b8fh-dQ4L._AC_SX679_.jpg",
    "url": "https://www.amazon.com/Queen-Size-Piece-Sheet-Set/dp/B01M16WBW1/ref=zg_bs_g_home-garden_d_sccl_1/135-4503962-8697157?psc=1"
  },
  {
    "asin": "B0BZYCJK89",
    "rank": 2,
    "title": "Owala FreeSip Insulated Stainless Steel Water Bottle with Straw, BPA-Free Sports Water Bottle, Great for Travel, 24 Oz, Denim",
    "price": "$29.99",
    "list_price": "$29.99",
    "discount": null,
    "rating": "4.7 out of 5 stars",
    "reviews_count": "92,349 ratings",
    "is_prime": true,
    "best_sellers_rank": "1 in Kitchen & Dining ",
    "bullet_points": [
      "24-ounce insulated stainless-steel water bottle with a FreeSip spout and push-button lid with lock",
      "Patented FreeSip spout designed for either sipping upright through the built-in straw or tilting back to swig from the spout opening",
      "Protective push-to-open lid keeps spout clean; convenient carry loop doubles as a lock",
      "Double-wall insulation keeps drinks cold for up to 24 hours; wide opening for cleaning and adding ice; cup holder-friendly base",
      "BPA, lead, and phthalate-free; hand wash cup, dishwasher-safe lid; not for use with hot liquids"
    ],
    "main_image_url": "https://m.media-amazon.com/images/I/61sS-XIvEXL._AC_SX679_.jpg",
    "url": "https://www.amazon.com/Owala-FreeSip-Insulated-Stainless-BPA-Free/dp/B0BZYCJK89/ref=zg_bs_g_home-garden_d_sccl_2/135-4503962-8697157?psc=1"
  },
  {
    "asin": "B07T869RNY",
    "rank": 3,
    "title": "Zevo Flying Insect Trap & Cartridge - Plug in Fly Trap & Indoor Bug Catcher for Gnats, House & Fruit Flies - Mess-Free - Use in Any Room - Uses Blue & UV Light (1 Plug in Device & 1 Cartridge)",
    "price": "$19.97",
    "list_price": "$9.99",
    "discount": null,
    "rating": "4.2 out of 5 stars",
    "reviews_count": "69,299 ratings",
    "is_prime": false,
    "best_sellers_rank": "1 in Patio",
    "bullet_points": [
      "Catch Flying Insects 24/7 - This flying insect trap uses blue and UV light to attract and catch house flies, fruit flies and gnats. Its continuous attraction helps it catch insects day and night.",
      "Mess-Free Disposal - This indoor fly trap and gnat catcher uses a powerful adhesive backing you will never have to touch. The adhesive pad can discreetly catch bugs, and discreetly faces the wall.",
      "Easy-to-Use - To use, remove the sheet from its adhesive backing, insert the disposable cartridge and plug the indoor bug trap into locations where bugs frequent. When full, lift the cartridge out of the insect catcher, and toss it in the garbage.",
      "Versatile Placement - You can place this plug in bug trap in your kitchen, bathroom, garage, bedroom, dining room, enclosed patio or in any socket near plants. These insect traps can be used indoors for easy, year-round protection.",
      "Includes 1 Plug-In Device and 1 Cartridge - This plug in fly trap comes with one cartridge. Shop our full collection to stock up on refills to ensure you always have one on hand, or bring home a Value Pack with multiple devices so you can keep a fly catcher in every room."
    ],
    "main_image_url": "https://m.media-amazon.com/images/I/81MdDswP1yL._AC_SX679_.jpg",
    "url": "https://www.amazon.com/Electric-Flying-Insect-Trap-Starter/dp/B07T869RNY/ref=zg_bs_g_home-garden_d_sccl_3/135-4503962-8697157?psc=1"
  },
  {
    "asin": "B0C3FTCYZL",
    "rank": 4,
    "title": "Zevo Flying Insect Trap Official Refill Cartridges - Fits Both Zevo Trap & MAX Indoor Fly Trap - Authentic Trap+Lock Technology to Catch Gnats, House & Fruit Flys (4 Official Refill Cartridges)",
    "price": "$14.82",
    "list_price": "$3.71",
    "discount": null,
    "rating": "4.8 out of 5 stars",
    "reviews_count": "29,612 ratings",
    "is_prime": true,
    "best_sellers_rank": "2 in Patio",
    "bullet_points": [
      "Designed for Zevo Devices - The Zevo Flying Insect Trap Refill can fit in both our MAX or standard indoor fly traps. You can use either pest control plug in as a continuous bug catcher to effortlessly trap gnats, house flies and fruit flies.",
      "Why Choose the Zevo Refill? - This product is the only Zevo approved refill and unlike other pest control traps, it is made with no added fragrance or dyes. Instead, the Zevo fly catcher uses blue and UV light to lure insects into the bug trap.",
      "Mess-Free Disposal - The fly trap refill features a strong adhesive backing that you never have to touch. Flying insects will be trapped here, and you can quickly pop the cartridge out to throw it away once it's full.",
      "Catch Insects 24/7 - Zevo fly traps can be used in any room, and will work night and day to catch pesky insects. Stock up on fly trap refills so you can keep a designated trap in your kitchen, bathroom, garage, screened porch, or any other living space.",
      "Includes 4 Refill Cartridges - This kit includes four flying insect trap refills. Stock up to ensure you always have one on hand and can count on year round protection."
    ],
    "main_image_url": "https://m.media-amazon.com/images/I/81-X1rSie5L._AC_SX679_.jpg",
    "url": "https://www.amazon.com/ZEVO-Flying-Insect-Refills-Indoor/dp/B0C3FTCYZL/ref=zg_bs_g_home-garden_d_sccl_4/135-4503962-8697157?psc=1"
  },
  {
    "asin": "B08QRFZ6TH",
    "rank": 5,
    "title": "Barossa Design Plastic Shower Liner Clear - Premium PEVA Shower Curtain Liner with Rustproof Grommets and 3 Magnets, Waterproof Cute Lightweight Standard Size Bathroom Curtains - Clear",
    "price": "$8.95",
    "list_price": "$9.99",
    "discount": "10%",
    "rating": "4.5 out of 5 stars",
    "reviews_count": "86,571 ratings",
    "is_prime": true,
    "best_sellers_rank": "5 in Home & Kitchen ",
    "bullet_points": [
      "Peva",
      "Premium PEVA: 3 magnets at bottom & 12 metal grommet holes, it can be used as a stand-alone shower curtain or shower liner",
      "Waterproof: The plastic shower curtain is quick to dry, keeps the water into your tub and no soaking compared to fabric liners, great inside shower liner to protect your outer curtain",
      "Lasting Durability: This clear shower curtain liner is sturdy with rustproof metal grommets and reinforced header, can last a long time",
      "Light Weight: The clear shower curtain is easy to wipe and dry quickly, keeping your bathroom clean"
    ],
    "main_image_url": "https://m.media-amazon.com/images/I/7136-eapqKL._AC_SX679_.jpg",
    "url": "https://www.amazon.com/Plastic-Shower-Liner-Clear-Chemical/dp/B08QRFZ6TH/ref=zg_bs_g_home-garden_d_sccl_5/135-4503962-8697157?psc=1"
  }
]